src/Documents/ИС_ЯМ_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_ЯМ_Заказ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>itemsTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>total</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>serviceName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>recipient</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>cancelRequested</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоDBS</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_МодельРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>items</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураЯМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодЯМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_ЯМ_Штрихкоды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>count</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>shipmentDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СтатусыСборочныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СтатусыСборочныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ЯМ_СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>substatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ЯМ_ДетальныеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_ЯМ_СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ЯМ_СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CANCELLED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELIVERED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELIVERY</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PICKUP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PROCESSING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UNPAID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PLACING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RESERVED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>REJECTED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PARTIALLY_RETURNED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RETURNED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CANCELLED_WITHOUT_REFUND</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UNKNOWN</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПередачаТоваровХранителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПередачаТоваровХранителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИС_ЯМ_Заказ/Forms/ФормаКиЗов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 20.05.24 УА #75485
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Профиль") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("СборочныеЗадания") Тогда
		Возврат;
	КонецЕсли;
	
	Профиль = Параметры.Профиль;
		
	ЗаполнитьДанныеКВыгрузке(Параметры.СборочныеЗадания);
	
	//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	//- ИнфоСофт Власова И.С. 10.12.24 УА #85294
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.05.24 УА #75485 

//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 10.12.24 УА #85294

//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 10.12.24 УА #85294

//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			СтруктураШтрихкод = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			ОбработатьШтрихкоды(СтруктураШтрихкод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 10.12.24 УА #85294

#КонецОбласти

#Область ОбработчикиКомандФормы 

//+ ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650
&НаКлиенте
Процедура ВыгрузитьКиЗы(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если ДанныеКВыгрузке.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет данных для выгрузки");
		Возврат;
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514	
	//Для Каждого Строка Из ДанныеКВыгрузке Цикл
	//	Если Не ЗначениеЗаполнено(Строка.КодМаркировки) Тогда
	//		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("В строке заказа %1 не заполнен КиЗ", Строка.НомерОтправления));
	//		Возврат;
	//   	КонецЕсли;
	//КонецЦикла;                                 
	//- ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
    
	ВыгрузитьКиЗыНаСервере();
	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650
&НаСервере
Процедура ЗаполнитьДанныеКВыгрузке(МассивЗаказов)
	
	//+ ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ИС_ЯМ_СтатусыЗаказов.PROCESSING); 
	МассивСтатусов.Добавить(Перечисления.ИС_ЯМ_СтатусыЗаказов.UNPAID); 
	МассивСтатусов.Добавить(Перечисления.ИС_ЯМ_СтатусыЗаказов.PLACING);
	МассивСтатусов.Добавить(Перечисления.ИС_ЯМ_СтатусыЗаказов.RESERVED); 
	МассивСтатусов.Добавить(Перечисления.ИС_ЯМ_СтатусыЗаказов.PENDING);
	МассивСтатусов.Добавить(Перечисления.ИС_ЯМ_СтатусыЗаказов.UNKNOWN);
	//- ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	
	//Получим основные данные
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_ЯМ_Заказ.Профиль КАК Профиль,
	|	ИС_ЯМ_Заказ.Номер КАК НомерОтправления,
	|	ИС_ЯМ_Заказ.Заказ КАК Заказ,
	|	ИС_ЯМ_Заказ.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Заказitems.НоменклатураЯМ.shopSku КАК Sku,
	|	ИС_ЯМ_Заказitems.count КАК count,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ИС_ЯМ_Заказitems.id КАК id
	|ПОМЕСТИТЬ ВТ_ОсновныеДанные
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказitems
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|			ПО ИС_ЯМ_Заказitems.НоменклатураЯМ = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ
	|		ПО ИС_ЯМ_Заказ.Ссылка = ИС_ЯМ_Заказitems.Ссылка
	//+ ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
	//- ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|ГДЕ
	|	ИС_ЯМ_Заказ.Ссылка В(&МассивСсылок)
	//+ ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status В(&МассивСтатусов)
	//- ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381	
	//|	И НЕ ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ВидНоменклатуры.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
	//- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_ЯМ_Заказitems.Ссылка КАК Ссылка,
	|	СУММА(ИС_ЯМ_Заказitems.count) КАК ВсегоТоваров
	|ПОМЕСТИТЬ ВТ_Количество
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказitems
	//+ ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|		ПО ИС_ЯМ_Заказitems.Ссылка = ИС_ЯМ_Заказ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
	//- ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|ГДЕ
	|	ИС_ЯМ_Заказitems.Ссылка В(&МассивСсылок)
	//+ ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status В(&МассивСтатусов)
	//- ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_Заказitems.Ссылка
	|;
	|                                                                                
	//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_ЯМ_Заказitems.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Заказitems.НоменклатураЯМ КАК НоменклатураЯМ,
	|	СУММА(ИС_ЯМ_Заказitems.count) КАК ВсегоПоАртикулу
	|ПОМЕСТИТЬ ВТ_КоличествоАртикул
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказitems 
	//+ ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
	|		ПО ИС_ЯМ_Заказitems.Ссылка = ИС_ЯМ_Заказ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
	//- ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|ГДЕ
	|	ИС_ЯМ_Заказitems.Ссылка В(&МассивСсылок) 
	//+ ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status В(&МассивСтатусов)
	//- ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_Заказitems.Ссылка,
	|	ИС_ЯМ_Заказitems.НоменклатураЯМ
	|;
	|                                           
	//- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеДанные.Профиль КАК Профиль,
	|	ВТ_ОсновныеДанные.НомерОтправления КАК НомерОтправления,
	|	ВТ_ОсновныеДанные.Заказ КАК Заказ,
	|	ВТ_ОсновныеДанные.Ссылка КАК Ссылка,
	|	ВТ_ОсновныеДанные.Sku КАК Sku,
	|	ВТ_ОсновныеДанные.count КАК count,
	//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
	|	ВТ_КоличествоАртикул.ВсегоПоАртикулу КАК ВсегоПоАртикулу,
	//- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
	|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика, 
	|	ВТ_ОсновныеДанные.id КАК IDТовараВЗаказе,
	|	ВТ_Количество.ВсегоТоваров КАК ВсегоТоваровВЗаказе
	|ИЗ
	|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Количество КАК ВТ_Количество
	|		ПО ВТ_ОсновныеДанные.Ссылка = ВТ_Количество.Ссылка
	//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоАртикул КАК ВТ_КоличествоАртикул
	|		ПО ВТ_ОсновныеДанные.Ссылка = ВТ_КоличествоАртикул.Ссылка
	|			И ВТ_ОсновныеДанные.Sku = ВТ_КоличествоАртикул.НоменклатураЯМ.shopSku";
	//- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивЗаказов);
	
	//+ ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	//- ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл	
	
		Итератор = 0;
		Пока Выборка.count > Итератор Цикл  
	
			НоваяСтрока = ДанныеКВыгрузке.Добавить();
			//+ ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514
			НоваяСтрока.КоличествоКоробок = 1;
			НоваяСтрока.IDКоробки = 1;
			//- ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			Итератор = Итератор + 1;
	
		КонецЦикла;
	
	КонецЦикла;
	
	//Получим Коды маркировки. Учтена функциональность пакетного создания реализаций, поэтому данные по Киз получаем в отдельном запросе	
	ЗапросКоды = Новый Запрос;

	//+ ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	//+ ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
	//Если ИС_MP_Сервер.ПолучитьВерсиюБезРедакции() >= "5.19.44" Тогда
	ВерсияБезРедации = ИС_МП_Сервер.ВерсияБезРедакции();
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ВерсияБезРедации, "5.19.44") >= 0 Тогда
	//- ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
		
		ЗапросКоды.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
		|	РеализацияТоваровУслугТовары.Ссылка КАК Реализация
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО (ИС_ЯМ_Заказ.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
		|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
		|ГДЕ
		|	ИС_ЯМ_Заказ.Ссылка В(&МассивСсылок)
		|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status В(&МассивСтатусов)
		|	И НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюТовары.Номенклатура,
		|	ПередачаТоваровХранителюТовары.Характеристика,
		|	ПередачаТоваровХранителюТовары.Ссылка
		|ИЗ
		|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
		|		ПО ИС_ЯМ_Заказ.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
		|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
		|ГДЕ
		|	ИС_ЯМ_Заказ.Ссылка В(&МассивСсылок)
		|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status В(&МассивСтатусов)
		|	И НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|		ПО ВТ_РТУ.Реализация = РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка
		|			И ВТ_РТУ.Номенклатура = РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура
		|			И ВТ_РТУ.Характеристика = РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика
		|ГДЕ
		|	НЕ РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.ШтрихкодыУпаковок КАК ПередачаТоваровХранителюШтрихкодыУпаковок
		|		ПО ВТ_РТУ.Реализация = ПередачаТоваровХранителюШтрихкодыУпаковок.Ссылка
		|			И ВТ_РТУ.Номенклатура = ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура
		|			И ВТ_РТУ.Характеристика = ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика
		|ГДЕ
		|	НЕ ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки ЕСТЬ NULL";
	Иначе
		ЗапросКоды.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
		|	РеализацияТоваровУслугТовары.Ссылка КАК Реализация
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	Документ.ИС_ЯМ_Заказ КАК ИС_ЯМ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО (ИС_ЯМ_Заказ.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента) 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
		|		ПО (ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ = ИС_ЯМ_Заказ.Ссылка)
		|ГДЕ
		|	ИС_ЯМ_Заказ.Ссылка В (&МассивСсылок)  
		|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status В(&МассивСтатусов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|		ПО (ВТ_РТУ.Реализация = РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка
		|				И ВТ_РТУ.Номенклатура = РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура
		|				И ВТ_РТУ.Характеристика = РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика)";	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	
	ЗапросКоды.УстановитьПараметр("МассивСсылок", МассивЗаказов); 
	
	//+ ИнфоСофт Заварин К.В. 23.09.24 УА #73485
	ЗапросКоды.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	//- ИнфоСофт Заварин К.В. 23.09.24 УА #73485
		
	РезультатЗапросаКоды = ЗапросКоды.Выполнить();
	
	ВыборкаКоды = РезультатЗапросаКоды.Выбрать();
	
	МассивКиз = Новый Массив;
	
	Пока ВыборкаКоды.Следующий() Цикл
		СтруктураКиз = ПолучитьСтруктуруКиз(ВыборкаКоды);
		МассивКиз.Добавить(СтруктураКиз);
	КонецЦикла;
	
	Для Каждого Строка Из ДанныеКВыгрузке Цикл 
				
	    ЭлементМассива = НайтиКиз(МассивКиз, Строка);
		
		Если ЭлементМассива <> Неопределено Тогда
			
			Строка.ШтрихкодУпаковки = ЭлементМассива.ШтрихкодУпаковки;
			
			Если ЗначениеЗаполнено(ЭлементМассива.ЗначениеШтрихкода) Тогда
				
				КодМаркировки = ИС_MP_Маркировка.ПолучитьКизНоменклатуры(ЭлементМассива);     
				
				Строка.КодМаркировки = КодМаркировки;

			КонецЕсли;
			
			ЭлементМассива = МассивКиз.Найти(ЭлементМассива);
			МассивКиз.Удалить(ЭлементМассива);
		
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650 

//+ ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650
&НаСервере
Функция ПолучитьСтруктуруКиз(Выборка)  
	
	СтруктураКиз = Новый Структура;  
	
	СтруктураКиз.Вставить("ШтрихкодУпаковки", 	Выборка.ШтрихкодУпаковки);
	СтруктураКиз.Вставить("ЗначениеШтрихкода", 	Выборка.ЗначениеШтрихкода);
	СтруктураКиз.Вставить("Номенклатура", 		Выборка.Номенклатура);
	СтруктураКиз.Вставить("Характеристика",		Выборка.Характеристика);
	
	Возврат СтруктураКиз;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650

//+ ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650
&НаСервере
Функция НайтиКиз(МассивКиз, Строка)
	
	Результат = Неопределено;
	
	Для Каждого Элемент Из МассивКиз Цикл
				
		Если Элемент.Номенклатура = Строка.Номенклатура И Элемент.Характеристика = Строка.Характеристика Тогда  
			//+ ИнфоСофт Стояк Ю.К. 16.09.2024 УА #83542			
			Отбор = Новый Структура;
			Отбор.Вставить("ШтрихкодУпаковки", Элемент.ШтрихкодУпаковки); 
			
			НайденныеСтроки = ДанныеКВыгрузке.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Возврат Элемент;
			КонецЕсли;
			
			Продолжить;
			//- ИнфоСофт Стояк Ю.К. 16.09.2024 УА #83542
			
		КонецЕсли;	
	
	КонецЦикла;	
	
	Возврат Результат;


КонецФункции //- ИнфоСофт Сумин Д.В. 05.02.2024 УА #69650	

//+ ИнфоСофт Ивонин К.А. 17.05.24 УА #75485
&НаСервере
Процедура ВыгрузитьКиЗыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ДанныеПоКизам.IDТовараВЗаказе КАК IDТовараВЗаказе,
	|	ВТ_ДанныеПоКизам.НомерОтправления КАК НомерОтправления,
	|	ВТ_ДанныеПоКизам.КодМаркировки КАК КодМаркировки,
	//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
	|	ВТ_ДанныеПоКизам.ПолныйКодМаркировки КАК ПолныйКодМаркировки,
	//- ИнфоСофт Власова И.С. 10.12.24 УА #85294
	//+ ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514
	|	ВТ_ДанныеПоКизам.КоличествоКоробок КАК КоличествоКоробок,
	|	ВТ_ДанныеПоКизам.IDКоробки КАК IDКоробки,
	//- ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514
	//+ ИнфоСофт Стояк Ю.К. 28.08.2024 УА #81381
	|	ВТ_ДанныеПоКизам.count КАК count,
	|	ВТ_ДанныеПоКизам.count КАК ВсегоПоАртикулу,
	//- ИнфоСофт Стояк Ю.К. 28.08.2024 УА #81381
	|	ВТ_ДанныеПоКизам.ВсегоТоваровВЗаказе КАК ВсегоТоваровВЗаказе
	|ПОМЕСТИТЬ ВТ_ДанныеКиЗов
	|ИЗ
	|	&ВТ_ДанныеПоКизам КАК ВТ_ДанныеПоКизам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеКиЗов.IDТовараВЗаказе КАК IDТовараВЗаказе,
	|	ВТ_ДанныеКиЗов.НомерОтправления КАК НомерОтправления,
	|	ВТ_ДанныеКиЗов.КодМаркировки КАК КодМаркировки,
	//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
	|	ВТ_ДанныеКиЗов.ПолныйКодМаркировки КАК ПолныйКодМаркировки,	
	//- ИнфоСофт Власова И.С. 10.12.24 УА #85294
	//+ ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514
	|	ВТ_ДанныеКиЗов.КоличествоКоробок КАК КоличествоКоробок,
	|	ВТ_ДанныеКиЗов.IDКоробки КАК IDКоробки,
	//- ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514
	//+ ИнфоСофт Стояк Ю.К. 28.08.2024 УА #81381
	|	ВТ_ДанныеКиЗов.count КАК count,
	|	ВТ_ДанныеКиЗов.count КАК ВсегоПоАртикулу,
	//- ИнфоСофт Стояк Ю.К. 28.08.2024 УА #81381
	|	ВТ_ДанныеКиЗов.ВсегоТоваровВЗаказе КАК ВсегоТоваровВЗаказе
	|ИЗ
	|	ВТ_ДанныеКиЗов КАК ВТ_ДанныеКиЗов
	|ИТОГИ ПО
	|	НомерОтправления,
	|	IDКоробки,
	|	IDТовараВЗаказе";
	
	Запрос.УстановитьПараметр("ВТ_ДанныеПоКизам", ДанныеКВыгрузке.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();    		
	
	//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381	
	//МассивДанныхНаВыгрузку = Новый Массив();
	//- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381	
	
	//+ ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
	ВыборкаНомерОтправления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерОтправления");
	//ВыборкаНомерОтправления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//- ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
	
	//+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143 
	РазделительGS1 = МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1();
	ЭкранированныйСимволGS1 = "\u001d";
	//- ИнфоСофт Заварин К.В. 04.04.25 УА #95143
	
	Пока ВыборкаНомерОтправления.Следующий() Цикл   
		
		//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381	
		МассивДанныхНаВыгрузку = Новый Массив();
		//- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
		
		//+ ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514		
		ВыборкаIDКоробки = ВыборкаНомерОтправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "IDКоробки");
		//ВыборкаIDТовараВЗаказе = ВыборкаНомерОтправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//- ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
		
		Пока ВыборкаIDКоробки.Следующий() Цикл
			
			//+ ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514			
			СтруктураItems = Новый Структура("items", Неопределено);
			//- ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
			МассивItems = Новый Массив;                 
			//+ ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
			ВыборкаIDТовараВЗаказе = ВыборкаIDКоробки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "IDТовараВЗаказе");
			//ВыборкаIDТовараВЗаказе = ВыборкаIDКоробки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировка);
			//- ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
			
			Пока ВыборкаIDТовараВЗаказе.Следующий() Цикл
				
				ВыборкаКиЗов = ВыборкаIDТовараВЗаказе.Выбрать();
				
				СтруктураДанных = Новый Структура;
				МассивCIS = Новый Массив;
				
				Первый = Истина;  
				
				Пока ВыборкаКиЗов.Следующий() Цикл
					//+ ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
					Если ВыборкаКиЗов.КоличествоКоробок > 1 Тогда 
						
						Отбор = Новый Структура;
						Отбор.Вставить("IDТовараВЗаказе", ВыборкаКиЗов.IDТовараВЗаказе); 
						Отбор.Вставить("ТребуетсяРазместить", Истина); 
						
						НайденныеСтроки = БуферДляВыгрузки.НайтиСтроки(Отбор);
						
						Если НайденныеСтроки.Количество() > 0 Тогда 
							
							ТекущийИД = НайденныеСтроки[0].НомерЧасти + 1; 
							
							Для каждого СтрокаТаблицы Из БуферДляВыгрузки Цикл
								БуферДляВыгрузки.Удалить(СтрокаТаблицы)
							КонецЦикла;
						
						Иначе
							ТекущийИД = 1;
						КонецЕсли;
						
						НСтр = БуферДляВыгрузки.Добавить();
						НСтр.IDТовараВЗаказе = ВыборкаКиЗов.IDТовараВЗаказе;
						НСтр.НомерЧасти = ТекущийИД;
						НСтр.ТребуетсяРазместить = Истина;
						НСтр.ВсегоЧастей = ВыборкаКиЗов.КоличествоКоробок;
						//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
						//НСтр.КИЗ = ВыборкаКиЗов.КодМаркировки;
						НСтр.КИЗ = ВыборкаКиЗов.ПолныйКодМаркировки;
						
						Если Не ЗначениеЗаполнено(НСтр.КИЗ) Тогда
							НСтр.КИЗ = ВыборкаКиЗов.КодМаркировки;
						КонецЕсли;
						//- ИнфоСофт Власова И.С. 10.12.24 УА #85294
							
						СтруктураДанных.Вставить("id", ВыборкаКиЗов.IDТовараВЗаказе); 
						
						partialCount = Новый Структура;
						partialCount.Вставить("current", ТекущийИД);
						partialCount.Вставить("total", ВыборкаКиЗов.КоличествоКоробок);
						
						СтруктураДанных.Вставить("partialCount", partialCount); 
						
						//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
						//Если ВыборкаКиЗов.КодМаркировки <> "" Тогда
						Если ВыборкаКиЗов.ПолныйКодМаркировки <> "" Тогда
							
						    //+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143
							//МассивCIS.Добавить(Новый Структура("cis", ВыборкаКиЗов.ПолныйКодМаркировки));
							КодМаркировкиGS1 = СтрЗаменить(ВыборкаКиЗов.ПолныйКодМаркировки, ЭкранированныйСимволGS1, РазделительGS1);
							МассивCIS.Добавить(Новый Структура("cis", КодМаркировкиGS1));
							//- ИнфоСофт Заварин К.В. 04.04.25 УА #95143
							
							СтруктураДанных.Вставить("instances", МассивCIS);
						ИначеЕсли ВыборкаКиЗов.КодМаркировки <> "" Тогда
						//- ИнфоСофт Власова И.С. 10.12.24 УА #85294
							МассивCIS.Добавить(Новый Структура("cis", ВыборкаКиЗов.КодМаркировки));							
							СтруктураДанных.Вставить("instances", МассивCIS);
						КонецЕсли;
						
						МассивItems.Добавить(СтруктураДанных); 
						
						СтруктураДанных = Новый Структура;					
						МассивCIS = Новый Массив;
								
					Иначе
						//- ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514	
						Если Первый Тогда
							
							СтруктураДанных.Вставить("id", 		  ВыборкаКиЗов.IDТовараВЗаказе);
							//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381							
							//СтруктураДанных.Вставить("fullCount", ВыборкаКиЗов.ВсегоТоваровВЗаказе);
							СтруктураДанных.Вставить("fullCount", ВыборкаКиЗов.ВсегоПоАртикулу);
							//- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
							
							Первый = Ложь;
							
						КонецЕсли;
						
						//+ ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514				
						//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
						//Если ВыборкаКиЗов.КодМаркировки <> "" Тогда
						Если ВыборкаКиЗов.ПолныйКодМаркировки <> "" Тогда
							
						    //+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143
							//МассивCIS.Добавить(Новый Структура("cis", ВыборкаКиЗов.ПолныйКодМаркировки));
							КодМаркировкиGS1 = СтрЗаменить(ВыборкаКиЗов.ПолныйКодМаркировки, ЭкранированныйСимволGS1, РазделительGS1);
							МассивCIS.Добавить(Новый Структура("cis", КодМаркировкиGS1));
							//- ИнфоСофт Заварин К.В. 04.04.25 УА #95143
							
							СтруктураДанных.Вставить("instances", МассивCIS);
						ИначеЕсли ВыборкаКиЗов.КодМаркировки <> "" Тогда
						//- ИнфоСофт Власова И.С. 10.12.24 УА #85294
							МассивCIS.Добавить(Новый Структура("cis", ВыборкаКиЗов.КодМаркировки));
						КонецЕсли;
						//МассивCIS.Добавить(Новый Структура("cis", ВыборкаКиЗов.КодМаркировки));					
					КонецЕсли;
					//- ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514  				
				КонецЦикла;
				
				//+ ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514
				Если МассивCIS.Количество() <> 0 Тогда
					СтруктураДанных.Вставить("instances", МассивCIS);
				КонецЕсли;                                           
				//СтруктураДанных.Вставить("instances", МассивCIS); 
				Если СтруктураДанных.Свойство("id")Тогда            
					МассивItems.Добавить(СтруктураДанных);
				КонецЕсли;
				//МассивItems.Добавить(СтруктураДанных);
				
				
			КонецЦикла;
			
			СтруктураItems.items = МассивItems;
			МассивДанныхНаВыгрузку.Добавить(СтруктураItems);
			
			Для Каждого Элемент Из БуферДляВыгрузки Цикл
				
				СтруктураДанных = Новый Структура;					
				МассивCIS = Новый Массив;
				
				Для Итератор = Элемент.НомерЧасти + 1 По Элемент.ВсегоЧастей Цикл  
					СтруктураItems = Новый Структура("items", Неопределено);
					МассивItems = Новый Массив;
					
					СтруктураДанных.Вставить("id", Элемент.IDТовараВЗаказе); 
					
					partialCount = Новый Структура;
					partialCount.Вставить("current", Итератор);
					partialCount.Вставить("total", Элемент.ВсегоЧастей);
					
					СтруктураДанных.Вставить("partialCount", partialCount); 
					
					Если Элемент.КИЗ <> "" Тогда
						МассивCIS.Добавить(Новый Структура("cis", Элемент.КИЗ));							
						СтруктураДанных.Вставить("instances", МассивCIS);
					КонецЕсли;
					
					МассивItems.Добавить(СтруктураДанных);
					
					СтруктураItems.items = МассивItems;
					МассивДанныхНаВыгрузку.Добавить(СтруктураItems);
					
				КонецЦикла;
				
			КонецЦикла;
			
			
			//- ИнфоСофт Стояк Ю.К. 02.08.2024 УА #79514						
			
		КонецЦикла;
		
		//+ ИнфоСофт Стояк Ю.К. 05.08.2024 УА #7951		
		Результат = ИС_ЯМ_Сервер.ПрикрепитьКиз(Профиль, ВыборкаНомерОтправления.НомерОтправления, МассивДанныхНаВыгрузку);
		//Результат = ИС_ЯМ_Сервер.ПрикрепитьКиз(Профиль, ВыборкаНомерОтправления.НомерОтправления, МассивItems);
		//- ИнфоСофт Стояк Ю.К. 05.08.2024 УА #79514
		
		Если Результат = Неопределено Тогда
			Продолжить;
		Иначе
			
			Отбор = Новый Структура("НомерОтправления", ВыборкаНомерОтправления.НомерОтправления);
			НайденныеСтроки = ДанныеКВыгрузке.НайтиСтроки(Отбор);
			
			Для Каждого Строка Из НайденныеСтроки Цикл
				Строка.Выгружен = Истина;
				
				//+ ИнфоСофт Заварин К.В. 20.02.25 УА #73904
				
				МассивКодов = Новый Массив;
				
				МассивКодов.Добавить(Строка);
				
				ЗаказМП = Документы.ИС_ЯМ_Заказ.НайтиПоНомеру(ВыборкаНомерОтправления.НомерОтправления);
				ИС_MP_Сервер.ЗаписатьДанныеКИЗ(Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, ЗаказМП, МассивКодов); 	
				//- ИнфоСофт Заварин К.В. 20.02.25 УА #73904
				
			КонецЦикла;
				
		КонецЕсли;
	
	КонецЦикла;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.05.24 УА #75485

//+ ИнфоСофт Власова И.С. 10.12.24 УА #85294
//+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143
//&НаСервере 
&НаКлиенте
 //- ИнфоСофт Заварин К.В. 04.04.25 УА #95143
Процедура ОбработатьШтрихкоды(Данные)
	
	СчитанныйШтрихкод = Данные.Штрихкод;
	
	РазделительGS1 = МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1();
    ЭкранированныйСимволGS1 = "\u001d";
	
	//+ ИнфоСофт Заварин К.В. 04.04.25 УА #95143
	//КодМаркировки = ИС_MP_Маркировка.ПолучитьКизНоменклатуры(СчитанныйШтрихкод);
	//- ИнфоСофт Заварин К.В. 04.04.25 УА #95143
	
    ПолныйКодМаркировки = СтрЗаменить(СчитанныйШтрихкод, РазделительGS1, ЭкранированныйСимволGS1);
	
	//+ ИнфоСофт Заварин К.В. 03.04.25 УА #95143
	ЭкранированныйСимволGS1 = "";
	КодМаркировки = СтрЗаменить(СчитанныйШтрихкод, РазделительGS1, ЭкранированныйСимволGS1);  	
		
	КодМаркировки = ОбработатьШтрихкодыНаСервере(КодМаркировки);
	//- ИнфоСофт Заварин К.В. 03.04.25 УА #95143
	
	Отбор = Новый Структура("КодМаркировки", КодМаркировки);
	НайденныеСтроки = ДанныеКВыгрузке.НайтиСтроки(Отбор);
	
	Для Каждого Строка Из НайденныеСтроки Цикл
		Строка.ПолныйКодМаркировки = ПолныйКодМаркировки;
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 10.12.24 УА #85294

//+ ИнфоСофт Заварин К.В. 03.04.25 УА #95143
&НаСервере
Функция ОбработатьШтрихкодыНаСервере(ДанныеШтрихкода)
			
	Данные = Новый Структура; 
	
	Данные.Вставить("ЗначениеШтрихкода", ДанныеШтрихкода);
	
	КодМаркировки = ИС_MP_Маркировка.ПолучитьКизНоменклатуры(Данные);
	
	Возврат	КодМаркировки;  
	
КонецФункции //- ИнфоСофт Заварин К.В. 03.04.25 УА #95143


#КонецОбласти
